advanced/frontend/models/SignupForm.php

    public function signup()
    {
        if (!$this->validate()) {
            return null;
        }

        $user = new User();
       $user->first_name = $this->first_name;
       $user->last_name = $this->last_name;

        $user->username = $this->username;
        $user->email = $this->email;
        $user->setPassword($this->password);
        $user->generateAuthKey();

        return $user->save() ? $user : null;
---
INSERT INTO `user` (`first_name`, `last_name`, `username`, `email`, `password_hash`, `auth_key`, `status`, `created_at`, `updated_at`) VALUES ('mohmmed', 'elousttah', 'eloustah1234', 'eloustah22342@gmail.com', '$2y$13$2D.wU0A/ru.df5P3bdpqg.x9Z8LEGWnqZlU88lXfQbrFbAhwt3Ao2', 'X1feTyzjSwYJvZ_eHqms5wi2odiDYliv', 10, 1503406430, 1503406430)