advanced/backend/controllers/Data1Controller.php

    public function actionCreate()
    {
        $model = new Data1();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `data_1` (`email_address`, `phone_number`, `Text_about`) VALUES ('a@a.com', '3112312321', 'as\'dkas[\'d]pas[,[\'as,d\'pa')

    protected function findModel($id)
    {
        if (($model = Data1::findOne($id)) !== null) {
---
SELECT * FROM `data_1` WHERE `id`='1'